## Lesson 10 - Pandas Advanced

Outline:

* concat
* append
* merge
* join
* set_option
* stack
* unstack
* transpose
* dot-notation
* values
* apply
* lambda
* sort_index
* sort_values
* to_csv
* read_csv
* isnull

In [1]:
# import modules
import pandas as pd
import numpy as np

### Merging, joining, and concatenating DataFrames
See [pandas documentation](http://pandas.pydata.org/pandas-docs/stable/merging.html) for more information.

This table describes how the funcitons were are going to learn about are related to each other:

Action        | Combine two          | Add one to another
--------------|----------------------|-------------------
Concatenating | pd.concat([df1, df2) | df1.append(df2)
Merging       | pd.merge(df1, df2)   | df1.join(df2)

**concat**

    pd.concat(objs, axis=0, join='outer', join_axes=None, 
        ignore_index=False, keys=None, levels=None, names=None, 
        verify_integrity=False)
       
* objs: list or dict of Series, DataFrame, or Panel objects. If a dict is passed, the sorted keys will be used as the keys argument, unless it is passed, in which case the values will be selected (see below)
* axis: {0, 1, ...}, default 0. The axis to concatenate along
* join: {‘inner’, ‘outer’}, default ‘outer’. How to handle indexes on other axis(es). Outer for union and inner for intersection
* join_axes: list of Index objects. Specific indexes to use for the other n - 1 axes instead of performing inner/outer set logic
* keys: sequence, default None. Construct hierarchical index using the passed keys as the outermost level If multiple levels passed, should contain tuples.
* levels : list of sequences, default None. If keys passed, specific levels to use for the resulting MultiIndex. Otherwise they will be inferred from the keys
* names: list, default None. Names for the levels in the resulting hierarchical index
* verify_integrity: boolean, default False. Check whether the new concatenated axis contains duplicates. This can be very expensive relative to the actual data concatenation
* ignore_index : boolean, default False. If True, do not use the index values on the concatenation axis. The resulting axis will be labeled 0, ..., n - 1. This is useful if you are concatenating objects where the concatenation axis does not have meaningful indexing information.

In [2]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                    index=[0, 1, 2, 3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                    index=[4, 5, 6, 7]) 
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                    index=[8, 9, 10, 11])

In [3]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [4]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [5]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [6]:
frames = [df1, df2, df3]
result = pd.concat(frames)
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [7]:
result = pd.concat(frames, keys=('x', 'y', 'z'))
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [8]:
result.ix['y']

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [9]:
df4 = pd.DataFrame({'B': ['B2', 'B3', 'B6', 'B7'],
                    'D': ['D2', 'D3', 'D6', 'D7'],
                    'F': ['F2', 'F3', 'F6', 'F7']},
                    index=[2, 3, 6, 7])
df4

    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

In [10]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [11]:
pd.concat([df1, df4]) # axis=0

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
2  NaN  B2  NaN  D2   F2
3  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [12]:
pd.concat([df1, df4], axis=1)

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [13]:
pd.concat([df1, df4], axis=1, join='outer')

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [14]:
pd.concat([df1, df4], axis=1, join='inner')

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [15]:
# Ignoring indexes
pd.concat([df1, df4], ignore_index=True)

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [16]:
s3 = pd.Series([0, 1, 2, 3], name='foo')
s4 = pd.Series([0, 1, 2, 3])
s5 = pd.Series([0, 1, 4, 5])
result = pd.concat([s3, s4, s5], axis=1)
result

   foo  0  1
0    0  0  0
1    1  1  1
2    2  2  4
3    3  3  5

In [17]:
result = pd.concat([s3, s4, s5], axis=1, keys=('red', 'blue', 'yellow'))
result

   red  blue  yellow
0    0     0       0
1    1     1       1
2    2     2       4
3    3     3       5

**append**

In [18]:
df1.append(df2)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [19]:
df1.append(df4)

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
2  NaN  B2  NaN  D2   F2
3  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

**merge**

    pd.merge(left, right, how='inner', on=None, left_on=None, 
        right_on=None, left_index=False, right_index=False,
        sort=True, suffixes=('_x', '_y'), copy=True, indicator=False)

* left: A DataFrame object
* right: Another DataFrame object
* on: Columns (names) to join on. Must be found in both the left and right DataFrame objects. If not passed and left_index and right_index are False, the intersection of the columns in the DataFrames will be inferred to be the join keys
* left_on: Columns from the left DataFrame to use as keys. Can either be column names or arrays with length equal to the length of the DataFrame
* right_on: Columns from the right DataFrame to use as keys. Can either be column names or arrays with length equal to the length of the DataFrame
* left_index: If True, use the index (row labels) from the left DataFrame as its join key(s). In the case of a DataFrame with a MultiIndex (hierarchical), the number of levels must match the number of join keys from the right DataFrame
* right_index: Same usage as left_index for the right DataFrame
* how: One of 'left', 'right', 'outer', 'inner'. Defaults to inner. See below for more detailed description of each method
* sort: Sort the result DataFrame by the join keys in lexicographical order. Defaults to True, setting to False will improve performance substantially in many cases
* suffixes: A tuple of string suffixes to apply to overlapping columns. Defaults to ('_x', '_y').
* copy: Always copy data (default True) from the passed DataFrame objects, even when reindexing is not necessary. Cannot be avoided in many cases but may improve performance / memory usage. The cases where copying can be avoided are somewhat pathological but this option is provided nonetheless.
* indicator: Add a column to the output DataFrame called _merge with information on the source of each row. _merge is Categorical-type and takes on a value of left_only for observations whose merge key only appears in 'left' DataFrame, right_only for observations whose merge key only appears in 'right' DataFrame, and both if the observation’s merge key is found in both.

In [20]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
right = pd.DataFrame({'key': ['K3', 'K2', 'K1', 'K0'],
                      'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3']})

In [21]:
left

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [22]:
right

    C   D key
0  C0  D0  K3
1  C1  D1  K2
2  C2  D2  K1
3  C3  D3  K0

In [23]:
result = pd.merge(left, right, on='key')
result

    A   B key   C   D
0  A0  B0  K0  C3  D3
1  A1  B1  K1  C2  D2
2  A2  B2  K2  C1  D1
3  A3  B3  K3  C0  D0

In [24]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                      'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3']})

In [25]:
left

    A   B key1 key2
0  A0  B0   K0   K0
1  A1  B1   K0   K1
2  A2  B2   K1   K0
3  A3  B3   K2   K1

In [26]:
right

    C   D key1 key2
0  C0  D0   K0   K0
1  C1  D1   K1   K0
2  C2  D2   K1   K0
3  C3  D3   K2   K0

In [27]:
pd.merge(left, right, on=['key1', 'key2'])

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
1  A2  B2   K1   K0  C1  D1
2  A2  B2   K1   K0  C2  D2

The how argument to merge specifies how to determine which keys are to be included in the resulting table. If a key combination does not appear in either the left or right tables, the values in the joined table will be NA. Here is a summary of the how options and their SQL equivalent names:

Merge method | SQL Join Name | Description
------------ | ---------------- | -----------
left         | LEFT OUTER JOIN  | Use keys from left frame only
right	     | RIGHT OUTER JOIN	| Use keys from right frame only
outer	     | FULL OUTER JOIN	| Use union of keys from both frames
inner	     | INNER JOIN	    | Use intersection of keys from both frames

In [28]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

    A   B key1 key2    C    D
0  A0  B0   K0   K0   C0   D0
1  A1  B1   K0   K1  NaN  NaN
2  A2  B2   K1   K0   C1   D1
3  A2  B2   K1   K0   C2   D2
4  A3  B3   K2   K1  NaN  NaN

In [29]:
result = pd.merge(left, right, how='right', on=['key1', 'key2'])
result

     A    B key1 key2   C   D
0   A0   B0   K0   K0  C0  D0
1   A2   B2   K1   K0  C1  D1
2   A2   B2   K1   K0  C2  D2
3  NaN  NaN   K2   K0  C3  D3

In [30]:
result = pd.merge(left, right, how='outer', on=['key1', 'key2'])
result

     A    B key1 key2    C    D
0   A0   B0   K0   K0   C0   D0
1   A1   B1   K0   K1  NaN  NaN
2   A2   B2   K1   K0   C1   D1
3   A2   B2   K1   K0   C2   D2
4   A3   B3   K2   K1  NaN  NaN
5  NaN  NaN   K2   K0   C3   D3

In [31]:
result = pd.merge(left, right, how='inner', on=['key1', 'key2'])
result

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
1  A2  B2   K1   K0  C1  D1
2  A2  B2   K1   K0  C2  D2

In [32]:
# The merge indicator
df1 = pd.DataFrame({'col1':[0,1], 'col_left':['a','b']})
df2 = pd.DataFrame({'col1':[1,2,2],'col_right':[2,2,2]})

In [33]:
df1

   col1 col_left
0     0        a
1     1        b

In [34]:
df2

   col1  col_right
0     1          2
1     2          2
2     2          2

In [35]:
# Note: Argument indicator=True is an option with pandas 0.17.0 and greater
result = pd.merge(df1, df2, on='col1', how='outer', indicator='Merged')
result

   col1 col_left  col_right      Merged
0     0        a        NaN   left_only
1     1        b        2.0        both
2     2      NaN        2.0  right_only
3     2      NaN        2.0  right_only

#### df.join()

The related DataFrame.join method, uses merge internally for the index-on-index and index-on-column(s) joins, but joins on indexes by default rather than trying to join on common columns (the default behavior for merge). If you are joining on index, you may wish to use DataFrame.join to save yourself some typing.

In [36]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                     index=['K0', 'K1', 'K2'])
right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                      'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [37]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [38]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [39]:
left.join(right, how='left')

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [40]:
left.join(right, how='right')

      A    B   C   D
K0   A0   B0  C0  D0
K2   A2   B2  C2  D2
K3  NaN  NaN  C3  D3

In [41]:
left.join(right, how='inner')

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

In [42]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [43]:
# Overlapping value columns: suffixes
left = pd.DataFrame({'k': ['K0', 'K1', 'K2'], 'v': [1, 2, 3]})
right = pd.DataFrame({'k': ['K0', 'K0', 'K3'], 'v': [4, 5, 6]})

In [44]:
left

    k  v
0  K0  1
1  K1  2
2  K2  3

In [45]:
right

    k  v
0  K0  4
1  K0  5
2  K3  6

In [46]:
result = pd.merge(left, right, on='k')
result

    k  v_x  v_y
0  K0    1    4
1  K0    1    5

In [47]:
result = pd.merge(left, right, on='k', suffixes=['_l', '_r'])
result

    k  v_l  v_r
0  K0    1    4
1  K0    1    5

In [48]:
# Why would I use this? Example: Merging gene tables
degs = pd.DataFrame({'gene': ['cds1', 'cds3', 'cds6'], 'count': [345, 887, 459]})
names = pd.DataFrame({'gene': ['cds1', 'cds2', 'cds3', 'cds4', 'cds5', 'cds6'], 'description': ['primase', 'ligase', 'aldolase', 'amylase', 'polymerase', 'kinase']})

In [49]:
degs

   count  gene
0    345  cds1
1    887  cds3
2    459  cds6

In [50]:
names

  description  gene
0     primase  cds1
1      ligase  cds2
2    aldolase  cds3
3     amylase  cds4
4  polymerase  cds5
5      kinase  cds6

In [51]:
degs_plus_names = pd.merge(degs, names)

In [52]:
degs_plus_names

   count  gene description
0    345  cds1     primase
1    887  cds3    aldolase
2    459  cds6      kinase

In [53]:
# Argument settings on and how were inferred/defaults
degs_plus_names = pd.merge(degs, names, on='gene', how='inner')

In [54]:
degs_plus_names

   count  gene description
0    345  cds1     primase
1    887  cds3    aldolase
2    459  cds6      kinase

#### merge/join by index

In [55]:
degs.index = degs.gene
degs

      count  gene
gene
cds1    345  cds1
cds3    887  cds3
cds6    459  cds6

In [56]:
names.index = names.gene
names

     description  gene
gene
cds1     primase  cds1
cds2      ligase  cds2
cds3    aldolase  cds3
cds4     amylase  cds4
cds5  polymerase  cds5
cds6      kinase  cds6

In [57]:
pd.merge(left=degs, right=names, left_index=True, right_index=True)

      count gene_x description gene_y
gene
cds1    345   cds1     primase   cds1
cds3    887   cds3    aldolase   cds3
cds6    459   cds6      kinase   cds6

### World Series example

#### pd.set_option()

In [58]:
# set the maximum number of DataFrame rows displayed
pd.set_option("display.max_rows", 10)

In [59]:
df_ws = pd.read_csv('world_series_winners.txt', header=None)
df_ws.columns = ['team']

In [60]:
df_ws

                     team
0        Boston Americans
1         No World Series
2         New York Giants
3       Chicago White Sox
4            Chicago Cubs
..                    ...
108   St. Louis Cardinals
109  San Francisco Giants
110        Boston Red Sox
111  San Francisco Giants
112    Kansas City Royals

[113 rows x 1 columns]

In [61]:
df_cubs = pd.DataFrame({'team': ['Chicago Cubs']})

In [62]:
df_cubs

           team
0  Chicago Cubs

#### pd.concat()

In [63]:
df2 = pd.concat([df_ws, df_cubs], ignore_index=True)
df2

                     team
0        Boston Americans
1         No World Series
2         New York Giants
3       Chicago White Sox
4            Chicago Cubs
..                    ...
109  San Francisco Giants
110        Boston Red Sox
111  San Francisco Giants
112    Kansas City Royals
113          Chicago Cubs

[114 rows x 1 columns]

#### add columns

In [64]:
df2['year'] = np.arange(1903, 2017)
df2['first_initial'] = [team[0] for team in df2['team']]

In [65]:
df2

                     team  year first_initial
0        Boston Americans  1903             B
1         No World Series  1904             N
2         New York Giants  1905             N
3       Chicago White Sox  1906             C
4            Chicago Cubs  1907             C
..                    ...   ...           ...
109  San Francisco Giants  2012             S
110        Boston Red Sox  2013             B
111  San Francisco Giants  2014             S
112    Kansas City Royals  2015             K
113          Chicago Cubs  2016             C

[114 rows x 3 columns]

#### df.stack()

In [66]:
stack_df = df2.stack()
stack_df

0    team             Boston Americans
     year                         1903
     first_initial                   B
1    team              No World Series
     year                         1904
                            ...
112  year                         2015
     first_initial                   K
113  team                 Chicago Cubs
     year                         2016
     first_initial                   C
dtype: object

In [67]:
stack_df[113]['team']

'Chicago Cubs'

#### df.unstack()

In [68]:
unstack_df = df2.unstack()
unstack_df

team           0       Boston Americans
               1        No World Series
               2        New York Giants
               3      Chicago White Sox
               4           Chicago Cubs
                            ...
first_initial  109                    S
               110                    B
               111                    S
               112                    K
               113                    C
dtype: object

In [69]:
unstack_df['team'][113]

'Chicago Cubs'

### Survey data example

In [70]:
df = pd.read_csv('survey_scores_2015.csv', index_col=0)

In [71]:
df

,10000,13001,60985,43309,89785,57688,19366,97775,22384,31556,70964,70155,47724,37602
subject_id,,,,,,,,,,,,,,
computer_has,N,Y,Y,Y,Y,Y,Y,Y,Y,Y,Y,Y,Y,Y
computer_os,NaN,Mac,Windows,Mac,Windows,Mac,Mac,Mac,Windows,Mac,Mac,Linux,Mac,Linux
score_bash,0,1,0,3,2,1,0,2,0,1,1,1,0,2
score_command,0,2,1,3,2,1,2,2,0,2,1,1,0,2
score_matlab,0,3,1,0,0,1,3,3,2,3,2,1,1,0
score_perl,0,0,0,0,1,0,0,0,0,0,0,0,0,1
score_python,0,0,2,1,2,0,0,1,0,0,1,1,0,1
score_r,0,0,1,2,2,0,2,0,2,0,2,0,0,2

In [72]:
df = df.transpose()

In [73]:
df

subject_id,computer_has,computer_os,score_bash,score_command,score_matlab,score_perl,score_python,score_r
10000,N,NaN,0,0,0,0,0,0
13001,Y,Mac,1,2,3,0,0,0
60985,Y,Windows,0,1,1,0,2,1
43309,Y,Mac,3,3,0,0,1,2
89785,Y,Windows,2,2,0,1,2,2
...,...,...,...,...,...,...,...,...
31556,Y,Mac,1,2,3,0,0,0
70964,Y,Mac,1,1,2,0,1,2
70155,Y,Linux,1,1,1,0,1,0
47724,Y,Mac,0,0,1,0,0,0
37602,Y,Linux,2,2,0,1,1,2

In [74]:
df.dtypes

subject_id
computer_has     object
computer_os      object
score_bash       object
score_command    object
score_matlab     object
score_perl       object
score_python     object
score_r          object
dtype: object

In [75]:
df.iloc[:,2:]

subject_id,score_bash,score_command,score_matlab,score_perl,score_python,score_r
10000,0,0,0,0,0,0
13001,1,2,3,0,0,0
60985,0,1,1,0,2,1
43309,3,3,0,0,1,2
89785,2,2,0,1,2,2
...,...,...,...,...,...,...
31556,1,2,3,0,0,0
70964,1,1,2,0,1,2
70155,1,1,1,0,1,0
47724,0,0,1,0,0,0
37602,2,2,0,1,1,2

In [76]:
numeric_cols = ['score_bash', 'score_command', 'score_matlab', 'score_perl', 'score_python', 'score_r']

In [77]:
df[numeric_cols] = df[numeric_cols].apply(pd.to_numeric)

In [78]:
df.dtypes

subject_id
computer_has     object
computer_os      object
score_bash        int64
score_command     int64
score_matlab      int64
score_perl        int64
score_python      int64
score_r           int64
dtype: object

#### df.stack() and df.unstack() (again)

In [79]:
df.stack()

       subject_id
10000  computer_has     N
       score_bash       0
       score_command    0
       score_matlab     0
       score_perl       0
                       ..
37602  score_command    2
       score_matlab     0
       score_perl       1
       score_python     1
       score_r          2
dtype: object

In [80]:
df.unstack()

subject_id
computer_has  10000    N
              13001    Y
              60985    Y
              43309    Y
              89785    Y
                      ..
score_r       31556    0
              70964    2
              70155    0
              47724    0
              37602    2
dtype: object

**dot-notation**

In [81]:
df.score_bash

10000    0
13001    1
60985    0
43309    3
89785    2
        ..
31556    1
70964    1
70155    1
47724    0
37602    2
Name: score_bash, dtype: int64

**values**

In [82]:
# Sometimes you need the values of a DataFrame, not the DataFrame representation of it
df.score_bash.values

array([0, 1, 0, 3, 2, 1, 0, 2, 0, 1, 1, 1, 0, 2])

**apply, lambda**

In [83]:
f = lambda x: x.max() - x.min()

In [84]:
g = lambda x: x.value_counts()

In [85]:
df[numeric_cols].apply(f)

subject_id
score_bash       3
score_command    3
score_matlab     3
score_perl       1
score_python     2
score_r          2
dtype: int64

In [86]:
df['score_command'].value_counts()

2    6
1    4
0    3
3    1
Name: score_command, dtype: int64

In [87]:
df[numeric_cols].apply(g)

subject_id,score_bash,score_command,score_matlab,score_perl,score_python,score_r
0,5,3,4,12.0,7.0,7.0
1,5,4,4,2.0,5.0,1.0
2,3,6,2,NaN,2.0,6.0
3,1,1,4,NaN,NaN,NaN

**sort_index, sort_values**

In [88]:
df.sort_index(axis=0, ascending=True, inplace=False)

subject_id,computer_has,computer_os,score_bash,score_command,score_matlab,score_perl,score_python,score_r
10000,N,NaN,0,0,0,0,0,0
13001,Y,Mac,1,2,3,0,0,0
19366,Y,Mac,0,2,3,0,0,2
22384,Y,Windows,0,0,2,0,0,2
31556,Y,Mac,1,2,3,0,0,0
...,...,...,...,...,...,...,...,...
60985,Y,Windows,0,1,1,0,2,1
70155,Y,Linux,1,1,1,0,1,0
70964,Y,Mac,1,1,2,0,1,2
89785,Y,Windows,2,2,0,1,2,2
97775,Y,Mac,2,2,3,0,1,0

In [89]:
df.sort_values('score_matlab', axis=0, ascending=False, inplace=False)

subject_id,computer_has,computer_os,score_bash,score_command,score_matlab,score_perl,score_python,score_r
13001,Y,Mac,1,2,3,0,0,0
19366,Y,Mac,0,2,3,0,0,2
97775,Y,Mac,2,2,3,0,1,0
31556,Y,Mac,1,2,3,0,0,0
22384,Y,Windows,0,0,2,0,0,2
...,...,...,...,...,...,...,...,...
47724,Y,Mac,0,0,1,0,0,0
10000,N,NaN,0,0,0,0,0,0
43309,Y,Mac,3,3,0,0,1,2
89785,Y,Windows,2,2,0,1,2,2
37602,Y,Linux,2,2,0,1,1,2

#### to_csv

In [90]:
df.to_csv('survey_scores_2015_T.csv')

**read_csv** (import with unknowns and bools)

In [91]:
# Note: I'm using a transposed version of the csv file
# We can specify the dtypes when we read_csv
df = pd.read_csv('survey_scores_2015_T.csv', index_col=0, dtype={'score_bash': np.int, 'score_command': np.int, 'score_matlab': np.int, 'score_perl': np.int, 'score_python': np.int, 'score_r': np.int})

In [92]:
df

,computer_has,computer_os,score_bash,score_command,score_matlab,score_perl,score_python,score_r
10000,N,NaN,0,0,0,0,0,0
13001,Y,Mac,1,2,3,0,0,0
60985,Y,Windows,0,1,1,0,2,1
43309,Y,Mac,3,3,0,0,1,2
89785,Y,Windows,2,2,0,1,2,2
...,...,...,...,...,...,...,...,...
31556,Y,Mac,1,2,3,0,0,0
70964,Y,Mac,1,1,2,0,1,2
70155,Y,Linux,1,1,1,0,1,0
47724,Y,Mac,0,0,1,0,0,0
37602,Y,Linux,2,2,0,1,1,2

In [93]:
df.dtypes

computer_has     object
computer_os      object
score_bash        int64
score_command     int64
score_matlab      int64
score_perl        int64
score_python      int64
score_r           int64
dtype: object

In [94]:
# We can change the Y/N strings to boolean True/False using a dict and map
yn_tf = {'Y': True, 'N': False}
df['computer_has'] = df['computer_has'].map(yn_tf)

In [95]:
df

,computer_has,computer_os,score_bash,score_command,score_matlab,score_perl,score_python,score_r
10000,False,NaN,0,0,0,0,0,0
13001,True,Mac,1,2,3,0,0,0
60985,True,Windows,0,1,1,0,2,1
43309,True,Mac,3,3,0,0,1,2
89785,True,Windows,2,2,0,1,2,2
...,...,...,...,...,...,...,...,...
31556,True,Mac,1,2,3,0,0,0
70964,True,Mac,1,1,2,0,1,2
70155,True,Linux,1,1,1,0,1,0
47724,True,Mac,0,0,1,0,0,0
37602,True,Linux,2,2,0,1,1,2

In [96]:
df.dtypes

computer_has       bool
computer_os      object
score_bash        int64
score_command     int64
score_matlab      int64
score_perl        int64
score_python      int64
score_r           int64
dtype: object

#### df.isnull() (don't use isnan)

In [97]:
df.loc[10000, 'score_command'] = np.nan

In [98]:
df

,computer_has,computer_os,score_bash,score_command,score_matlab,score_perl,score_python,score_r
10000,False,NaN,0,NaN,0,0,0,0
13001,True,Mac,1,2.0,3,0,0,0
60985,True,Windows,0,1.0,1,0,2,1
43309,True,Mac,3,3.0,0,0,1,2
89785,True,Windows,2,2.0,0,1,2,2
...,...,...,...,...,...,...,...,...
31556,True,Mac,1,2.0,3,0,0,0
70964,True,Mac,1,1.0,2,0,1,2
70155,True,Linux,1,1.0,1,0,1,0
47724,True,Mac,0,0.0,1,0,0,0
37602,True,Linux,2,2.0,0,1,1,2

In [99]:
df.isnull()

,computer_has,computer_os,score_bash,score_command,score_matlab,score_perl,score_python,score_r
10000,False,True,False,True,False,False,False,False
13001,False,False,False,False,False,False,False,False
60985,False,False,False,False,False,False,False,False
43309,False,False,False,False,False,False,False,False
89785,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...
31556,False,False,False,False,False,False,False,False
70964,False,False,False,False,False,False,False,False
70155,False,False,False,False,False,False,False,False
47724,False,False,False,False,False,False,False,False
37602,False,False,False,False,False,False,False,False

#### Hey Instructor!

*MOVE SOME OF THIS MATERIAL TO THE END TO LESSON 9*